02. New data and CSVs/RH130/212/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         false;
    transient       yes;
    cellValueSourceCorrection on;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho         explicit 1;
            U           explicit 1;
            Yi          explicit 1;
            h           explicit 1;
            radiation   explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}


constantProperties
{
    rho0            1000;
    T0              310;
    Cp0             4100;

    constantVolume  false;
}


subModels
{
    particleForces
    {
    //    sphereDrag;
//        gravity;
    }

    injectionModels
    {
        model1
        {
            type            patchInjection;
            SOI             0.3;
            massTotal       1e-08;
            parcelBasisType mass;
            patchName       turbine;
            nParticle	    1e8;
            injectionMethod disc;
	    flowType        constantVelocity;
            U0              (400 0 0);
            duration        1;
            parcelsPerSecond 1e04;
            flowRateProfile constant 1;
	
            Cd              constant 0.9;


            sizeDistribution
            {
                type	fixedValue;
                fixedValueDistribution
                {
                    value        20e-09;
                }
            }
	}
    }

    dispersionModel stochasticDispersionRAS;

    patchInteractionModel localInteraction;//standardWallInteraction;

    heatTransferModel none;//RanzMarshall;

    compositionModel singleMixtureFraction;

    phaseChangeModel none;//liquidEvaporation;

    devolatilisationModel none;

    surfaceReactionModel none;

    stochasticCollisionModel none;

    surfaceFilmModel none;

    radiation       off;

/*    standardWallInteractionCoeffs
    {
        type            rebound;
    }*/

    localInteractionCoeffs
    {
        patches
        (
            "outlet|farfield"
            {
                type escape;
            }

            "wedgeR|wedgeL|turbine|bypassInlet|inlet|nozzle|engine"
            {
                type        rebound;
            }
        );
    }

    RanzMarshallCoeffs
    {
        BirdCorrection  off;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
            }
            liquid
            {
            }
            solid
            {
		C	1;
            }
        );
        YGasTot0        0;
        YLiquidTot0     0;
        YSolidTot0      1;
    }

 /*   liquidEvaporationCoeffs
    {
        enthalpyTransfer enthalpyDifference;

        activeLiquids   ( H2O );
    }*/
}


cloudFunctions
{

      voidFraction1
      {
	  type voidFraction;
      }

/*    patchPostProcessing1
    {
        type            patchPostProcessing;
        maxStoredParcels 100;
        patches         ( outlet );
    }*/
}



// ************************************************************************* //
